## 정렬

In [6]:
# 매직 명령어
%who

df	 num	 pd

In [7]:
%whos

Variable   Type         Data/Info
---------------------------------
df         DataFrame       co1  co2  co3  co4  co<...>  60   70   80   90   100
num        int          5
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>

In [8]:
del num

In [9]:
%whos

Variable   Type         Data/Info
---------------------------------
df         DataFrame       co1  co2  co3  co4  co<...>  60   70   80   90   100
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>

In [5]:
num = 5

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ], 
    columns=[f'co{r}'for r in range(1,11)]
)
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

### 값 정렬
#### 행 기준

In [4]:
# co2 컬럼의 값을 오름차순 
df.sort_values('co2')

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [5]:
# co2 컬럼의 값을 내림차순
df.sort_values('co2', ascending=False)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
2   10   20   30   40   50   60   70   80   90   100
1    2    4    6    8   10   12   14   16   18    20
0    1    3    5    7    9   11   13   15   17    19

#### 열 기준

In [13]:
# index 1의 값을 오름차순
df.sort_values(1, axis=1)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [14]:
# index 1의 값을 내림차순
df.sort_values(1, axis=1, ascending=False)

   co10  co9  co8  co7  co6  co5  co4  co3  co2  co1
0    19   17   15   13   11    9    7    5    3    1
1    20   18   16   14   12   10    8    6    4    2
2   100   90   80   70   60   50   40   30   20   10

### 인덱스 정렬

#### 행 기준

In [10]:
# 오름차순
df.sort_index()

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [11]:
# 내림차순
df.sort_index(ascending=False)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
2   10   20   30   40   50   60   70   80   90   100
1    2    4    6    8   10   12   14   16   18    20
0    1    3    5    7    9   11   13   15   17    19

#### 열 기준

In [12]:
# 오름차순
# 문자열로 인식해서 co10이 두 번째에 옴
df.sort_index(axis=1)

   co1  co10  co2  co3  co4  co5  co6  co7  co8  co9
0    1    19    3    5    7    9   11   13   15   17
1    2    20    4    6    8   10   12   14   16   18
2   10   100   20   30   40   50   60   70   80   90

In [13]:
df.columns

Index(['co1', 'co2', 'co3', 'co4', 'co5', 'co6', 'co7', 'co8', 'co9', 'co10'], dtype='object')

In [14]:
# 내림차순
df.sort_index(axis=1, ascending=False)

   co9  co8  co7  co6  co5  co4  co3  co2  co10  co1
0   17   15   13   11    9    7    5    3    19    1
1   18   16   14   12   10    8    6    4    20    2
2   90   80   70   60   50   40   30   20   100   10

In [ ]:
# [문제] 열의 인덱스를 다음과 같이 정렬하시오

# co10 co9 co8 ... co1

df.sort_index(axis=1, ascending=False)